# HasOneSegment Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Dimension..::..HasOneSegment Method
Dimension Class See Also
---
Determines whether a dimension has one segment.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public bool HasOneSegment()
```

Visual Basic
---
```text
Public Function HasOneSegment As Boolean
```

Visual C++
---
```text
public:
bool HasOneSegment()
```

# See Also
Dimension Class
Autodesk.Revit.DB Namespace